openfoam/duct-flow-2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    walls
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          8192;
        startFace       8064;
    }
    inlet
    {
        type            patch;
        nFaces          64;
        startFace       16256;
    }
    outlet
    {
        type            patch;
        nFaces          64;
        startFace       16320;
    }
    frontAndBack
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          128;
        startFace       16384;
    }
)

// ************************************************************************* //
