openfoam/duct-flow-2/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
4096
(
(0.0199427 0.974689 -4.55723e-21)
(0.0353633 0.977386 8.45191e-22)
(0.0493337 0.979522 9.22185e-22)
(0.0621477 0.981255 -7.65802e-22)
(0.0740189 0.982691 -2.47681e-21)
(0.0851055 0.983904 -2.32203e-21)
(0.0955262 0.984947 0)
(0.105372 0.98586 -4.9247e-21)
...
)
;

boundaryField
{
    walls
    {
        type            symmetry;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0 1 0);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           nonuniform List<vector> 
64
(
(0.724478 0.00890469 1.69332e-24)
(0.730209 0.00897008 -3.17227e-24)
(0.73603 0.00903813 1.01196e-24)
(0.741943 0.00910826 5.03317e-25)
(0.747951 0.00918012 1.47727e-25)
(0.754057 0.00925354 -1.63187e-24)
(0.760262 0.0093284 3.84309e-25)
(0.766569 0.00940466 -6.3595e-25)
...
)
;
    }
    frontAndBack
    {
        type            symmetry;
    }
}


// ************************************************************************* //
