openfoam/duct-flow-2/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
8064
(
0.000787914
0.0148371
0.00148565
0.0149273
0.00211127
0.0149994
0.00267784
0.0150584
...
)
;

boundaryField
{
    walls
    {
        type            symmetry;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           uniform -0.015625;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
64
(
0.0113198
0.0114094
0.0115004
0.0115928
0.0116867
0.0117821
0.0118791
0.0119776
...
)
;
    }
    frontAndBack
    {
        type            symmetry;
        value           uniform 0;
    }
}


// ************************************************************************* //
